Example

In [1]:
import pandas as pd

data = {
    'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02', '2023-01-01'],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'New York'],
    'Temperature': [32, 75, 30, 77, 35],
    'Humidity': [80, 60, 85, 55, 78]}

df = pd.DataFrame(data)
df.head()

         Date         City  Temperature  Humidity
0  2023-01-01     New York           32        80
1  2023-01-01  Los Angeles           75        60
2  2023-01-02     New York           30        85
3  2023-01-02  Los Angeles           77        55
4  2023-01-01     New York           35        78

In [3]:
dfp = df.pivot_table(index= "City", columns= "Date", values ="Temperature", aggfunc="mean" )
print(dfp)

Date         2023-01-01  2023-01-02
City
Los Angeles        75.0        77.0
New York           33.5        30.0

In [4]:
import pandas as pd
data = {'col_a': [1,2,3,4,5]}
df = pd.DataFrame(data)
result = df['col_a'].agg(['sum', 'mean', 'min'])
print(f"Multiple aggregations on col_a:\n{result}")

Multiple aggregations on col_a:
sum     15.0
mean     3.0
min      1.0
Name: col_a, dtype: float64

In [9]:
import pandas as pd
data = {
    'Date': pd.to_datetime(['2023-01-01','2023-01-02', '2023-01-03','2023-01-04','2023-01-05']),
    'Value': [10,12,15,13,18]
}

df = pd.DataFrame(data)

df['Rolling_Avg_2_Period'] = df['Value'].rolling(window=2).mean()
print(df)

        Date  Value  Rolling_Avg_2_Period
0 2023-01-01     10                   NaN
1 2023-01-02     12                  11.0
2 2023-01-03     15                  13.5
3 2023-01-04     13                  14.0
4 2023-01-05     18                  15.5